In [11]:
import pandas as pd

In [12]:
students = pd.read_excel('202 Student Demographics.xlsx', sheet_name="Students")
months = pd.read_excel('202 Student Demographics.xlsx', sheet_name="Months")

In [13]:
students.head()

,Student Name,Birth month,Birth day,Height (inches),# semesters completed at Calvin
0,Catherine DeJager,November,7,61.0,5
1,Olivia den Dulk,July,30,65.5,6
2,Nick Beery,February,25,72.0,2
3,Cliff Anderson,April,21,71.0,2

In [14]:
months.head()

  Month Name  Number
0    January       1
1   February       2
2      March       3
3      April       4
4        May       5

# Look up month names (`join`)

In [40]:
students_months = pd.merge(students, months, left_on="Birth month", right_on="Month Name", how="left")
students_months.head()

,Student Name,Birth month,Birth day,Height (inches),# semesters completed at Calvin,Month Name,Number
0,Catherine DeJager,November,7,61.0,5,November,11
1,Olivia den Dulk,July,30,65.5,6,July,7
2,Nick Beery,February,25,72.0,2,February,2
3,Cliff Anderson,April,21,71.0,2,April,4

In [39]:
renamed = students_months.rename(columns={
    "Number": "Month",
    "# semesters completed at Calvin": "n_semesters",
    "Height (inches)": "height_inches"
})
renamed

,Student Name,Birth month,Birth day,height_inches,n_semesters,Month Name,Month
0,Catherine DeJager,November,7,61.0,5,November,11
1,Olivia den Dulk,July,30,65.5,6,July,7
2,Nick Beery,February,25,72.0,2,February,2
3,Cliff Anderson,April,21,71.0,2,April,4

# Query by birth month (`query`)

In [46]:
before_september = renamed.query('Month < 9')
before_september

,Student Name,Birth month,Birth day,height_inches,n_semesters,Month Name,Month
1,Olivia den Dulk,July,30,65.5,6,July,7
2,Nick Beery,February,25,72.0,2,February,2
3,Cliff Anderson,April,21,71.0,2,April,4

In [47]:
renamed[renamed.Month < 9]

,Student Name,Birth month,Birth day,height_inches,n_semesters,Month Name,Month
1,Olivia den Dulk,July,30,65.5,6,July,7
2,Nick Beery,February,25,72.0,2,February,2
3,Cliff Anderson,April,21,71.0,2,April,4

# Summarize by group (`aggregate`)

In [41]:
renamed.groupby('n_semesters').size()

n_semesters
2    2
5    1
6    1
dtype: int64

In [42]:
renamed.groupby(renamed['n_semesters']).size()

n_semesters
2    2
5    1
6    1
dtype: int64

In [43]:
renamed['Month'].groupby(renamed['n_semesters']).min()

n_semesters
2     2
5    11
6     7
Name: Month, dtype: int64

In [44]:
renamed['height_inches'].groupby(renamed['n_semesters']).mean()

n_semesters
2    71.5
5    61.0
6    65.5
Name: height_inches, dtype: float64

# Dump to SQL

In [35]:
students.to_sql('students', con="sqlite:///students.db", if_exists='replace')
months.to_sql('months', con="sqlite:///students.db", if_exists='replace')